app/Controllers/Chat.php

    public function index()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/signin');
        }

        $userModel = new UserModel();
        $data['users'] = $userModel
            ->where('id !=', session()->get('user_id'))
            ->findAll();
---
SELECT *
FROM `users`
WHERE `id` != '5'

    public function sendMessage()
    {
        $messageModel = new MessageModel();

        $data = [
            'sender_id'   => session()->get('user_id'),
            'receiver_id' => $this->request->getPost('receiver_id'),
            'message'     => $this->request->getPost('message')
        ];

        if ($messageModel->insert($data)) {
---
INSERT INTO `messages` (`sender_id`, `receiver_id`, `message`) VALUES ('5', '4', 'sxsxdsc')

    public function getMessages()
    {
        $messageModel = new MessageModel();
        $receiverId = $this->request->getGet('receiver_id');
        $userId = session()->get('user_id');

        $messages = $messageModel
            ->groupStart()
                ->groupStart()
                    ->where('sender_id', $userId)
                    ->where('receiver_id', $receiverId)
                ->groupEnd()
                ->orGroupStart()
                    ->where('sender_id', $receiverId)
                    ->where('receiver_id', $userId)
                ->groupEnd()
            ->groupEnd()
            ->orderBy('created_at', 'ASC')
            ->findAll();
---
SELECT *
FROM `messages`
WHERE   (
   (
`sender_id` = '4'
AND `receiver_id` = '5'
  )
OR    (
`sender_id` = '5'
AND `receiver_id` = '4'
  )
 )
ORDER BY `created_at` ASC

    public function markAsRead()
    {
        $messageModel = new MessageModel();
        $receiverId = $this->request->getPost('sender_id');
        $userId = session()->get('user_id');

        $messageModel
            ->where('sender_id', $receiverId)
            ->where('receiver_id', $userId)
            ->where('is_read', 0)
            ->set(['is_read' => 1])
            ->update();
---
UPDATE `messages` SET `is_read` = 1
WHERE `sender_id` = '4'
AND `receiver_id` = '5'
AND `is_read` = 0