app/Models/UserModel.php

    public function getAllUsersExcept($userId)
    {
        return $this->where('id !=', $userId)->findAll();
---
SELECT *
FROM `users`
WHERE `id` != '5'